# IsVertical Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..IsVertical Property
WallSweepInfo Class See Also
---
Indicates whether the sweep or reveal is swept vertically or horizontally.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsVertical { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsVertical As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsVertical {
	bool get ();
}
```

# Remarks
Wall sweeps defined as a part of a vertical compound structure will always be horizontal.
# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace